essays/tcp2c10k.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>tcp to c10k</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'/>
<link rel="canonical" href="https://anuragpeshne.github.io/essays/tcp2c10k.html" />
</head>
<body>
<div id="content">
<h1 class="title">tcp to c10k</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Brief Background</a>
<ul>
<li><a href="#orgheadline2">Why Clojure</a></li>
</ul>
</li>
<li><a href="#orgheadline3">About</a></li>
<li><a href="#orgheadline15">Getting Started</a>
<ul>
<li><a href="#orgheadline4">Echo Server</a></li>
<li><a href="#orgheadline5">Concurrent Connections</a>
<ul>
<li><a href="#orgheadline6"><span class="todo TODO">TODO</span> Persistent Data Structure</a></li>
</ul>
</li>
<li><a href="#orgheadline13">HTTP request and response</a>
<ul>
<li><a href="#orgheadline8">Parsing GET request</a></li>
<li><a href="#orgheadline12">Generating response</a></li>
</ul>
</li>
<li><a href="#orgheadline14">File Server</a></li>
</ul>
</li>
</ul>
</div>
</div>
<script> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','//www.google-analytics.com/analytics.js','ga'); ga('create', 'UA-67524931-1', 'auto'); ga('send', 'pageview'); </script>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Brief Background</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Here's my bucket list for next couple of years: the things which I want to make
from scratch:
</p>
<ul class="org-ul">
<li>A Compiler</li>
<li>A Web Server</li>
<li>A Text Editor</li>
<li>Something that runs on bare metal; (maybe an OS)</li>
</ul>

<p>
It's over 4 months since I started with grad school at <a href="https://ufl.edu">UF</a>. With the Networking
and Concurrent Programming courses this semester, implementing a web server seemed
the most natural step forward. This is my attempt to take on the 2<sup>nd</sup> item in
the list.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Why Clojure</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
I considered Haskell, Clojure and Python to build this project. Since this can
be a great opportunity to learn a new language, Python was ruled out. I chose
Clojure over Haskell, because:
</p>
<ul class="org-ul">
<li>Clojure is a Lisp; I was craving to write some Lisp after <a href="https://mitpress.mit.edu/books/little-schemer">Little Schemer</a></li>
<li><a href="https://www.infoq.com/author/Rich-Hickey">Rich Hickey</a></li>
<li><a href="https://news.ycombinator.com/item?id=4122764">Couple</a> of <a href="https://www.quora.com/Which-power-programming-language-should-I-put-the-effort-into-learning-this-year-Clojure-or-Haskell">threads</a> mentioning Clojure to be more 'practical'</li>
</ul>

<p>
As of now, Clojure is turning out to be a great decision.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">About</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
I'm planning to use this essay as a journal to the project <a href="https://github.com/anuragpeshne/httpj">httpj</a>.  I'll record the
achievements and lessons learned in a diary fashion so that this may help
someone else to implement a HTTP server and most importantly, help me remember
things I learned. 'Adventures of HTTP Server Implementation' would have been
more appropriate title for this essay. Just another note, I'm more interested
in making a concurrent server than a perfect HTTP compliant server. Thus, I'll
favor implementations that result in simpler, faster server than complete RFC
compliant server. I'm using <a href="https://trello.com/b/wAJJ79cc/httpj">this board</a> to manage tasks.
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15">Getting Started</h2>
<div class="outline-text-2" id="text-orgheadline15">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Echo Server</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
The first stage is to make a simple server which accepts TCP connection and
simply echos back everything sent to it. This was pretty straight forward, but
a good exercise to get acquainted with the Clojure syntax.
</p>

<p>
<a href="https://github.com/anuragpeshne/httpj/blob/fdf7dbccb187a655f0c4652defbdec22780da479/src/httpj/core.clj">Here's the commit</a> and <a href="https://github.com/anuragpeshne/dfsServer/blob/master/server/Server.java">similar thing</a> in Java.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Concurrent Connections</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
The next logical step was to make it accept multiple concurrent TCP connections.
And the Java thing to do would have been to create a new thread to handle the new
connection. Creating thread takes time and resources, it's better to use a thread
pool (something similar to <code>[[https://docs.oracle.com/javase/7/docs/api/java/util/concurrent/ThreadPoolExecutor.html][ThreadPoolExecutor]]</code>) to manage and reuse threads to handle
the clients. We could then use <i>Java Interop</i> feature of Clojure to port this to
Clojure.
</p>

<p>
I went to through the chapter <a href="http://www.braveclojure.com/concurrency/">Concurrency</a> of the book Clojure for the brave and true and
found out various other methods to make the program concurrent. The first and the
most easiest way is to create a <code>[[https://clojuredocs.org/clojure.core/future][future]]</code> object. Right now, to get the project started
we'll use this construct; but we'll revisit concurrency after we have worked on
the protocol implementation to a fair extent.
</p>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="todo TODO">TODO</span> Persistent Data Structure</h4>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">HTTP request and response</h3>
<div class="outline-text-3" id="text-orgheadline13">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">Parsing GET request</h4>
<div class="outline-text-4" id="text-orgheadline8">
</div><ul class="org-ul"><li><a id="orgheadline7"></a>Looping: <code>loop - recur</code> construct<br  /></li></ul>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">Generating response</h4>
<div class="outline-text-4" id="text-orgheadline12">
</div><ul class="org-ul"><li><a id="orgheadline10"></a>HTTP 1.0 v/s HTTP 1.1<br  /><ul class="org-ul"><li><a id="orgheadline9"></a><code>Content-Length</code> and socket close.<br  /></li></ul></li>
<li><a id="orgheadline11"></a>Thread first macro, <code>-&gt;</code><br  /></li></ul>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">File Server</h3>
<div class="outline-text-3" id="text-orgheadline14">
<p>
A subject so complicated, it needs a level 2 heading.
</p>
</div>
</div>
</div>
<div id="disqus_thread"></div>
<script>
    var disqus_config = function () {
this.page.url = "https://anuragpeshne.github.io/essays/tcp2c10k.html";
this.page.identifier = "/essays/tcp2c10k.html";
};
    (function() {  // DON'T EDIT BELOW THIS LINE
        var d = document, s = d.createElement('script');

        s.src = '//anuragpeshne.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript></div>
<div id="postamble" class="status">
<p class="date">Date: 2016-10-30</p>
<p class="author">Author: Anurag Peshne</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
